{
  "backend/main.mo": "Motoko canister defining centres, embed config, mock tests, announcements, and user profiles with authorization checks and CRUD APIs.",
  "feature_evidence.json": "Feature evidence report linking features to frontend files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Collection of short summaries describing all major frontend files and their roles in routing, UI layout, pages, and assets.",
  "frontend/index.css": "Tailwind base styles and extensive OKLCH theme variables with light/dark mode colors applied globally.",
  "frontend/index.html": "HTML entry point defining metadata, favicons, fonts, and root mount point for the React app.",
  "frontend/src/App.tsx": "Configures all TanStack Router routes, layout, and hidden pages, returning the main RouterProvider.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with institute info, navigation links, contact details, social icons, and secret forest navigation.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive header with logo, navigation links, and mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Page layout wrapper providing header, main content area, and footer.",
  "frontend/src/components/media/FacebookVideoEmbed.tsx": "Embeds a Facebook video using the share URL and shows a fallback message if parsing fails.",
  "frontend/src/components/secret-forest/CharactersReveal.tsx": "Displays a grid of Demon Slayer character cards with styled effects.",
  "frontend/src/components/secret-forest/FireWheelKickoutSequence.tsx": "Runs a timed Fire Wheel and blackout sequence before navigating to a fake 404 page.",
  "frontend/src/components/secret-forest/FireWheelOverlay.tsx": "Shows a Fire Wheel video or fallback animation, auto-completing after a configured duration.",
  "frontend/src/components/secret-forest/ForestScene.tsx": "Renders an animated forest background with drifting effects and falling leaves.",
  "frontend/src/components/secret-forest/InfinityCastleFallSequence.tsx": "Timed sequence showing falling, Muzan appearance, and glitch phases before completion.",
  "frontend/src/components/secret-forest/MangaVolumesGrid.tsx": "Grid of links to Demon Slayer volumes on Viz, each displayed as a styled card.",
  "frontend/src/config/fireWheel.ts": "Configuration for Fire Wheel clip URL and timing values.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useEasterEggClickCounter.ts": "Tracks clicks for an easter egg and triggers a callback when a threshold is reached.",
  "frontend/src/hooks/useIdleDetector.ts": "Custom React hook that tracks user activity and triggers an idle callback after a configurable timeout.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and helpers for managing Internet Identity authentication via AuthClient.",
  "frontend/src/hooks/useLoopingAudio.ts": "Hook for creating and controlling a looping audio element with play, mute, and autoplay handling.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color variables and themed component/animation styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page requiring login and an access code, with admin status validation via actor calls.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Fetches and displays announcements with optional media using actor-backed queries and loading states.",
  "frontend/src/pages/CentresPage.tsx": "Fetches and displays centre data from the actor with loading states, empty state easter egg navigation, and a list of centres with contact info.",
  "frontend/src/pages/CoursesPage.tsx": "Renders a simple courses page with a header and a message indicating no course data is available.",
  "frontend/src/pages/Fake404KickoutPage.tsx": "Shows a stylized 404 kickout screen with dramatic visuals and a button to return home.",
  "frontend/src/pages/HomePage.tsx": "Displays the main homepage with hero section, video embeds, and feature highlights for the institute.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login, logout, and user profile setup with related queries and mutations.",
  "frontend/src/pages/MockTestsPage.tsx": "Fetches and displays mock tests filtered by type, rendering video, PDF, or text content with loading skeletons.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a simple 404 page with a message and a button to navigate back home.",
  "frontend/src/pages/ReviewsPage.tsx": "Displays static student and parent reviews with names, ratings, and locations.",
  "frontend/src/pages/SecretForestPage.tsx": "Implements the Secret Forest page with audio playback, idle‑triggered animation sequences, and click-based character reveal logic.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters with sessionStorage persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings for the frontend.",
  "project_state.json": "Metadata describing project requirements, architecture notes, known issues, and implemented features for the Saha Institute site."
}