{
  "backend/main.mo": "Primary canister with data models, maps, user profiles, announcements, mock tests, site-wide effects, and admin‑gated methods for access control and content management.",
  "backend/migration.mo": "Migration module that upgrades old actor state to add site-wide effect fields, popup lists, and new ID counters.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and requirements coverage.",
  "frontend-file-summaries.txt": "Prewritten summaries describing all frontend files, routes, components, and visual effects.",
  "frontend/index.css": "Global Tailwind layer defining color tokens, dark mode variables, and animation styles including admin and effect presets.",
  "frontend/index.html": "HTML entry point containing branding, meta tags, icons, font preloads, and root mount element.",
  "frontend/src/App.tsx": "Application router configuring all site pages, hidden routes, and layout wrapper via TanStack Router.",
  "frontend/src/components/effects/AdminEffectPresetPreview.tsx": "UI card component showing effect preset metadata, icon, color, and duration for admin selection.",
  "frontend/src/components/effects/presets/AuroraGlowEffect.tsx": "Preset visual effect rendering layered animated aurora‑style gradients for site‑wide activation.",
  "frontend/src/components/effects/presets/ConfettiBurstEffect.tsx": "Generates 100 randomly styled confetti pieces and animates them falling across the screen.",
  "frontend/src/components/effects/presets/FallingParticlesEffect.tsx": "Creates 50 gradient particles with random positions and fall animations.",
  "frontend/src/components/effects/presets/GlowSweepEffect.tsx": "Renders a horizontal glowing gradient that sweeps across the screen.",
  "frontend/src/components/effects/presets/ScreenPulseEffect.tsx": "Applies a full‑screen pulsing overlay using a simple animated div.",
  "frontend/src/components/effects/presets/ShimmerWaveEffect.tsx": "Displays a shimmering gradient wave animation across the full screen.",
  "frontend/src/components/effects/presets/SparkleTrailEffect.tsx": "Tracks mouse movement to spawn temporary sparkles that fade out.",
  "frontend/src/components/effects/presets/SpotlightRaysEffect.tsx": "Generates radial light rays rotating from the center with staggered animation delays.",
  "frontend/src/components/effects/siteWideEffectPresets.ts": "Defines metadata for various site‑wide visual effects, including ids, names, durations, colors, and icons.",
  "frontend/src/components/effects/SiteWideEffectsLayer.tsx": "Global overlay that listens to backend effect state and renders the correct visual effect component for a timed duration.",
  "frontend/src/components/effects/useSiteWideEffectState.ts": "Fetches the current active site‑wide effect from the backend using React Query with polling.",
  "frontend/src/components/layout/SiteFooter.tsx": "Renders the site footer with branding, navigation links, contact info, and social links.",
  "frontend/src/components/layout/SiteHeader.tsx": "Implements the responsive site header with logo, navigation links, login/admin buttons, and a mobile sheet menu.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps pages with header, footer, and the global effects layer.",
  "frontend/src/components/media/FacebookVideoEmbed.tsx": "Parses a Facebook share URL to generate an embeddable video iframe with a fallback message.",
  "frontend/src/components/secret-forest/CharactersReveal.tsx": "Displays a grid of Demon Slayer character cards with a styled reveal animation.",
  "frontend/src/components/secret-forest/FireWheelKickoutSequence.tsx": "Runs a timed fire‑wheel animation sequence followed by a blackout and redirects to a fake 404 page.",
  "frontend/src/components/secret-forest/FireWheelOverlay.tsx": "Displays a Fire Wheel video or YouTube clip with a timed auto-complete, falling back to a CSS fire animation if loading fails.",
  "frontend/src/components/secret-forest/ForestScene.tsx": "Renders an animated forest background with drifting gradients and falling leaf emojis.",
  "frontend/src/components/secret-forest/InfinityCastleFallSequence.tsx": "Runs a timed three-phase animation sequence (falling, Muzan reveal, glitch) and triggers completion after 47 seconds.",
  "frontend/src/components/secret-forest/MangaVolumesGrid.tsx": "Shows a grid of 23 manga volume cards linking to their official Viz pages.",
  "frontend/src/config/fireWheel.ts": "Defines configuration for Fire Wheel clip URL and timing values used in the overlay sequence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useEasterEggClickCounter.ts": "Tracks clicks toward a threshold and triggers a callback when reached, with automatic reset.",
  "frontend/src/hooks/useIdleDetector.ts": "Monitors user activity and fires a callback after a configurable idle duration, optionally requiring initial activity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and helpers for managing Internet Identity authentication and state via AuthClient.",
  "frontend/src/hooks/useLoopingAudio.ts": "Manages looping audio playback with auto-play handling, mute toggling, and blocked-autoplay detection.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive color variables for light and dark themes plus custom UI styles like neon and admin panel classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AdminPanelPage.tsx": "Implements an admin interface with access-code verification, effect triggers, popups, and admin-related mutations using actor calls.",
  "frontend/src/pages/AnnouncementsPage.tsx": "Fetches and displays announcements with date formatting and optional video or audio content.",
  "frontend/src/pages/CentresPage.tsx": "Loads and shows centre information with phone links and includes an Easter egg redirect when no data exists.",
  "frontend/src/pages/CoursesPage.tsx": "Static page showing a placeholder message for course and fee information.",
  "frontend/src/pages/Fake404KickoutPage.tsx": "Displays a stylized 404 kickout screen themed around a 'Fire Wheel' event with a button to return home.",
  "frontend/src/pages/HomePage.tsx": "Home landing page featuring hero content, embedded Facebook videos, and feature cards promoting the institute.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity login, profile fetching, and profile setup with mutation-based saving and logout logic.",
  "frontend/src/pages/MockTestsPage.tsx": "Fetches and displays mock tests with filtering by content type and renders video, PDF, or text content.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a styled 404 page with a button linking back to the home page.",
  "frontend/src/pages/ReviewsPage.tsx": "Displays static student review cards with ratings and contact info.",
  "frontend/src/pages/SecretForestPage.tsx": "Runs an interactive easter‑egg page with idle-triggered animation sequences, audio controls, and hidden character reveal logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, fonts, animations, and plugin support for typography, container queries, and animations.",
  "project_state.json": "JSON capturing project state, requirements, architectural notes, known issues, and feature metadata for the Saha Institute website build."
}